Repository: Ancyrafi/kursdemon
Catalog: lib/l10n/app_*.arb
Languages: es, pl

# dodajLekcje
source: Add Lesson
es: Agregar Lección
pl: Dodaj Lekcje

# homeTitle
source: Your E-learning Title
es: Título de tu E-learning
pl: Nazwa Kursu

# userLessonListTitle
source: Lesson
es: Lección
pl: Lekcje

# rootPanelTitle
source: Administration
es: Administración
pl: Administracja

# rootPanelFirstPage
source: Welcome to your Administration Panel
es: Bienvenido a tu Panel de Administración
pl: Witaj w panelu Administracyjny

# rootPanelRollTitle
source: Root Panel
es: Panel de Administrador
pl: Panel Zarządzania

# rootPanelRollUser
source: Users Manager
es: Gestor de Usuarios
pl: Zarządzaj Użytkownikami

# rootPanelRollLesson
source: Create Lesson
es: Crear Lección
pl: Dodaj Lekcje

# rootPanelRollBlog
source: Create Blog Content
es: Crear Contenido de Blog
pl: Dodaj wpis na Blog

# rootPanelRollSocial
source: Add Social Media Links
es: Agregar Enlaces de Redes Sociales
pl: Dodaj Social Media

# rootPanelRollLogOut
source: Log Out
es: Cerrar Sesión
pl: Wyloguj się

# deleteButtton
source: Delete
es: Eliminar
pl: Usuń

# chooseLessonButton
source: Choose Lesson
es: Seleccionar Lección
pl: Wybierz Lekcję

# listLessonInfo
source: Your Lesson List
es: Tu Lista de Lecciones
pl: Twoja Lista Lekcji

# createBlogButton
source: Add Blog Text
es: Agregar Texto de Blog
pl: Dodaj Wpis

# titleBlog
source: Type Blog Title
es: Escribe el Título del Blog
pl: Podaj Tytuł Bloga

# saveButton
source: Save
es: Guardar
pl: Zapisz

# hintBlogText
source: Just create your blog content here
es: Simplemente crea aquí el contenido de tu blog
pl: Zacznij tworzyć swój wpis

# editButton
source: Edit
es: Editar
pl: Edytuj

# addBlogButton
source: Add Blog
es: Agregar Blog
pl: Dodaj Wpis

# errorChooseLesson
source: You must choose a lesson
es: Debes seleccionar una lección
pl: Musisz wybrać lekcję

# addSectionInfo
source: Add Section
es: Agregar Sección
pl: Dodawanie Sekcji

# addSectionTitle
source: Type Section Title
es: Escribe el Título de la Sección
pl: Podaj Tytuł Sekcji

# addSectionLinkYoutube
source: Paste YouTube Link
es: Pega el Enlace de YouTube
pl: Podaj link do filmu z YouTube

# addSectionLinkGoogle
source: Paste Google Drive Link
es: Pega el Enlace de Google Drive
pl: Podaj link do filmu z Google Drive

# sectionErrorMessage
source: You can only paste one link, from YouTube or Google Drive
es: Solo puedes pegar un enlace, ya sea de YouTube o de Google Drive
pl: Podaj tylko jeden link, albo youtube albo do dysku google!

# sectionErrorMessage2
source: The title of the section is required, please add a title
es: Se requiere el título de la sección, por favor agrega un título
pl: Pole z tytułem sekcji jest wymagane

# lessonInfo
source: Create Lesson
es: Crear Lección
pl: Dodawanie Lekcji

# lessonAddTitle
source: Type Lesson Title Here..
es: Escribe el Título de la Lección aquí...
pl: Podaj tytuł lekcji

# errorLesson
source: Sorry, but the lesson title is required
es: Lo siento, pero se requiere el título de la lección
pl: Nie podałeś żadnego tytułu lekcji

# errorSocial
source: Link to your social media is required
es: Se requiere el enlace de tus redes sociales
pl: Musisz wypełnić to pole

# addUserInfo
source: Add Users
es: Agregar Usuarios
pl: Dodawanie Użytkownika

# addUserName
source: Name of your student
es: Nombre de tu estudiante
pl: Podaj imię swojego kursanta

# addUserSurrname
source: Surname of your student
es: Apellido de tu estudiante
pl: Podaj nazwisko swojego kursanta

# addUserEmail
source: E-mail of your student
es: Correo electrónico de tu estudiante
pl: Podaj E-mail kursanta

# addUserPassword
source: Password of your student's account
es: Contraseña de la cuenta de tu estudiante
pl: Tymczasowe hasło kursanta

# addUserButton
source: Create Account
es: Crear Cuenta
pl: Utwórz Konto

# addUserPassGenButton
source: Generate Password
es: Generar Contraseña
pl: Generuj Hasło

# userLessonInfo
source: Lesson
es: Lección
pl: Lekcje

# finishButton
source: Finish
es: Finalizar
pl: Ukończone

source: Password...
es: Contraseña...
pl: Wprowadź hasło...

# loginButton
source: Login
es: Iniciar Sesión
pl: Logowanie
